{- 
   Теоретико-типовая экспликация математического аппарата родов структур.
   См. 1) Приложение 2 книги: Кононенко А. А., Кучкаров 3. А., Никаноров С. П., Никитина Н. К.
   Технология концептуального проектирования/ Под ред. С. П. Никанорова.
   2-е стереотип, изд., — М.: Концепт. — 2008. — 580 с.
   2) Пономарёв И. Н. Введение в математическую логику и роды структур: Учебное
   пособие. — М. : МФТИ, 2007
-}
{-# OPTIONS --cubical --warning=noUnsupportedIndexedMatch #-}
{-# OPTIONS --guardedness #-}

module Base where

open import Cubical.Foundations.Prelude
open import Cubical.Foundations.Function using (_∘_; uncurry)
open import Cubical.Foundations.HLevels
open import Cubical.Foundations.Powerset using (ℙ; isSetℙ; _∈_)
open import Cubical.Foundations.Structure using (⟨_⟩)
open import Cubical.Data.Bool using (Bool; true; false; isSetBool)
open import Cubical.Data.Empty using (⊥*; isProp⊥*)
open import Cubical.Data.FinData using (Fin; zero; suc; one; two; three; four; five; toℕ)
open import Cubical.Data.Nat using (ℕ; zero; suc; _+_; _∸_; isSetℕ; max)
open import Cubical.Data.Nat.Order using (_≤_; isProp≤)
open import Cubical.Data.Sigma using (_×_; _,_; ∃; ∃-syntax)
open import Cubical.Data.Sum using (_⊎_)
open import Cubical.Data.Vec using (Vec; _∷_; []; lookup; head; tail; foldr; map) 
open import Cubical.Data.Unit using (Unit; tt; isPropUnit)
open import Cubical.HITs.PropositionalTruncation hiding (map) --using (∥_∥₁; ∣_∣₁; squash₁; isPropPropTrunc)

open import Powerset public


------------------------------------------------------------------
--== Ступени ==--

-- DSL родов структур. n = число базовых типов, m = число сомножителей
-- декартова произведения (≥ 2)
data СхемаСтупени (n : ℕ) : Type where
  base : Fin n → СхемаСтупени n                                 -- базовые типы
  𝔅    : СхемаСтупени n → СхемаСтупени n                        -- булеан  
  𝔇    : ∀ {m} → Vec (СхемаСтупени n) (2 + m) → СхемаСтупени n  -- декартиан, m ≥ 2

-- ранг ступени
ρ : ∀ {n} → СхемаСтупени n → ℕ
ρ (base x) = 1
ρ (𝔅 S) = ρ S + 1
ρ {n} (𝔇 LS) = maxL LS + 1
  where
  maxL : ∀ {m} → Vec (СхемаСтупени n) (2 + m) → ℕ
  maxL (S1 ∷ S2 ∷ []) = max (ρ S1) (ρ S2) 
  maxL (S1 ∷ S2 ∷ S3 ∷ tail) = max (ρ S1) (maxL (S2 ∷ S3 ∷ tail))


------------------------------------------------------------------
--== M-граф ==--

-- n - число базовых типов,
-- k - номер узла в M-графе (= число узлов в M-графе, к ктр. присоединяется ступень)
data M-узел (n : ℕ) : ℕ → Type where
  base : ∀ {k} → Fin n → M-узел n k
  𝔅    : ∀ {k} → Fin (1 + k) → M-узел n (1 + k)
  𝔇    : ∀ {k m} → Vec (Fin (2 + k)) (2 + m) → M-узел n (2 + k)

infixr 6 _&_

-- k - число узлов/ступеней
data M-граф (n : ℕ) : (k : ℕ) → Type where
  ∅   : M-граф n 0
  _&_ : ∀ {k} → M-узел n k → M-граф n k → M-граф n (1 + k)

-- Схема i-го узла графа.
-- Схемы есть у узлов, но не обязательно у графа в целом
M-Схема : ∀ {n k} → M-граф (1 + n) (1 + k) → Fin (1 + k) → СхемаСтупени (1 + n)
M-Схема (base i & _) zero = base i
M-Схема (𝔅 i & M) zero = 𝔅 (M-Схема M i)
M-Схема (𝔇 is & M) zero = 𝔇 (map (λ k → M-Схема M k) is)
M-Схема {k = suc k} (_ & M) (suc i) = M-Схема M i


------------------------------------------------------------------
--== Базисные типы ==--

-- Список типов, индексированный списком уровней.
-- Т.о. списки типов и уровней автоматически согласуются.
-- Допускаются только типы, являющиеся множествами (hSet).
data BaseSets : ∀ {n} → Vec Level n → Typeω where
  []  : BaseSets []
  _∷_ : ∀ {n ℓ1} {Lℓ : Vec Level n} → hSet ℓ1 → BaseSets Lℓ → BaseSets (ℓ1 ∷ Lℓ)

-- извлечение из BaseSets по индексу. BaseSets непуст.
_[_] : ∀ {n} {Lℓ : Vec Level (1 + n)} → BaseSets Lℓ → (i : Fin (1 + n)) → hSet (lookup i Lℓ)
_[_] (A ∷ _) zero = A
_[_] {suc n} (_ ∷ tail) (suc i) = tail [ i ] 


------------------------------------------------------------------
--== Основная теория: род структуры ==--

module РодСтруктуры 
    {n : ℕ}                     -- n = число базовых типов
    {Lℓ : Vec Level (1 + n)}    -- уровни базовых типов (n ≥ 1)
    (BS : BaseSets {1 + n} Lℓ)  -- список базовых типов (n ≥ 1)
    where

  -- суммарный уровень (универсума) схемы; зависит от списка уровней Lℓ
  ℓtot : СхемаСтупени (1 + n) → Level
  ℓtot (base i) = lookup i Lℓ
  ℓtot (𝔅 S) = ℓ-suc (ℓtot S)
  ℓtot (𝔇 (S1 ∷ S2 ∷ [])) = ℓ-max (ℓtot S1) (ℓtot S2)
  ℓtot (𝔇 (S1 ∷ S2 ∷ S3 ∷ tail)) = ℓ-max (ℓtot S1) (ℓtot (𝔇 (S2 ∷ S3 ∷ tail)))
  
  -- Ступень: перевод схемы в тип теории типов
  Ступень : (S : СхемаСтупени (1 + n)) → Type (ℓtot S) 
  Ступень (base i) = fst (BS [ i ])
  Ступень (𝔅 S) = ℙ (Ступень S)
  Ступень (𝔇 (S1 ∷ S2 ∷ [])) = Ступень S1 × Ступень S2
  Ступень (𝔇 (S1 ∷ S2 ∷ S3 ∷ tail)) = Ступень S1 × Ступень (𝔇 (S2 ∷ S3 ∷ tail))
  
  -- все ступени -- множества
  СтупеньIsSet : (S : СхемаСтупени (1 + n)) → isSet (Ступень S)
  СтупеньIsSet (base i) = snd (BS [ i ])
  СтупеньIsSet (𝔅 S) = isSetℙ
  СтупеньIsSet (𝔇 (S1 ∷ S2 ∷ [])) = isSet× (СтупеньIsSet S1) (СтупеньIsSet S2)
  СтупеньIsSet (𝔇 (S1 ∷ S2 ∷ S3 ∷ tail)) =
    isSet× (СтупеньIsSet S1) (СтупеньIsSet (𝔇 (S2 ∷ S3 ∷ tail)))
  
  -- Ступень i-го узла M-графа
  M-Ступень : ∀ {k} → (M : M-граф (1 + n) (1 + k)) → (i : Fin (1 + k)) → Type _ 
  M-Ступень M i = Ступень (M-Схема M i)
  
  
  -------------------------------------------------------
  --== операции над термами (ступеней) ==--
  
  -- понижение размерности (только для синглетонов)
  -- TODO: заменить на isContr (для ℙ)

  -- синглетон
  isSingl : ∀ {ℓ} {X : Type ℓ} → ℙ X → Type ℓ
  isSingl {ℓ} {X} t = Σ[ x ∈ X ] (t x .fst) × (∀ y → t y .fst → Path _ x y)
  
  Ступень↓ : ∀ {S : СхемаСтупени (1 + n)} → (t : Ступень (𝔅 S)) → isSingl t → Ступень S
  Ступень↓ _ p = fst p
  
  -- малая проекция
  
  pr : ∀ {m} {LS : Vec (СхемаСтупени (1 + n)) (2 + m)}
     → Ступень (𝔇 LS)
     → (i : Fin (2 + m))
     → Ступень (lookup i LS)
  pr {LS = _ ∷ _ ∷ []}    (x , _)     zero = x
  pr {LS = _ ∷ _ ∷ []}    (_ , x)      one = x
  pr {LS = _ ∷ _ ∷ _ ∷ _} (x , _)     zero = x
  pr {LS = _ ∷ _ ∷ _ ∷ _} (_ , xs) (suc i) = pr xs i
  
  -- повышение размерности
  
  Ступень↑ : ∀ {S : СхемаСтупени (1 + n)} → Ступень S → Ступень (𝔅 S)
  Ступень↑ {S} t = λ x → (t ≡ x) , СтупеньIsSet S t x
  
  -- Ступень↑ S - синглетон для любой ступени
  Ступень↑IsSingl : {S : СхемаСтупени (1 + n)}
    → (t : Ступень S)
    → isContr (ℙΣ (Ступень S) (Ступень↑ {S = S} t))  
  Ступень↑IsSingl t = isContrSingl t
  
  -- произведение элементов

  -- список термов для произведения. Индексирован схемами термов.
  data TermList : ∀ {m} (LS : Vec (СхемаСтупени (1 + n)) m) → Typeω where
    [] : TermList []
    _∷_ : ∀ {m} {LS : Vec (СхемаСтупени (1 + n)) m} {S : СхемаСтупени (1 + n)}
        → Ступень S → TermList LS → TermList (S ∷ LS)
  
  prodN : ∀ {m} {LS : Vec (СхемаСтупени (1 + n)) (2 + m)}
        → (Lt : TermList LS) → Ступень (𝔇 LS) 
  prodN (t1 ∷ t2 ∷ []) = t1 , t2
  prodN (t1 ∷ t2 ∷ t3 ∷ tail) = t1 , prodN (t2 ∷ t3 ∷ tail)
  
  
  -- большая проекция отношения
  -- TODO: нужна ли ∃ ?
  -- TODO: разобраться с Lift (или нет?)
  
  Pr : ∀ {m} {LS : Vec (СхемаСтупени (1 + n)) (2 + m)}
     → ℙ (Ступень (𝔇 LS))
     → (i : Fin (2 + m))
     → ℙ (Lift {j = ℓ-max (ℓtot (lookup i LS)) (ℓtot (𝔇 LS))} (Ступень (lookup i LS)))
  Pr {m} {LS} S i = λ x → isPr (lower x) , squash₁
    where
    isPr : Ступень (lookup i LS) → Type _
    isPr s = ∃[ y ∈ (Ступень (𝔇 LS)) ] (y ∈ S) × (s ≡ (pr y i))
  
 
  -- задание множества перечислением
  
  enum : ∀ {S : СхемаСтупени (1 + n)} {m} {LS : Vec (Ступень S) m}
       → (Ступень (𝔅 S))
  enum {S} {m} {LS} = λ x → any (λ y → (x ≡ y) , СтупеньIsSet S x y) LS 
    where
    _∨ʰ_ : ∀ {ℓ} → hProp ℓ → hProp ℓ → hProp ℓ
    (P , pP) ∨ʰ (Q , pQ) = ∥ P ⊎ Q ∥₁ , squash₁
  
    ⊥ʰ : ∀ {ℓ} → hProp ℓ
    ⊥ʰ = ⊥* , λ ()
    
    any : ∀ {ℓ} {A : Type ℓ} (P : A → hProp ℓ) → Vec A m → hProp ℓ
    any P V = foldr (λ x y → (P x) ∨ʰ y) (⊥ʰ) V
  
  -- простое объединение
  
  _∪_ : ∀ {S : СхемаСтупени (1 + n)}
      → (A B : Ступень (𝔅 S)) → Ступень (𝔅 S)
  A ∪ B = A ∪ᵖ B
  
  -- простое пересечение
  
  _∩_ : ∀ {S : СхемаСтупени (1 + n)}
      → (A B : Ступень (𝔅 S)) → Ступень (𝔅 S)
  A ∩ B = A ∩ᵖ B
  
  -- (добавим также импликацию)
  
  _⇒_ : ∀ {S : СхемаСтупени (1 + n)}
      → (A B : Ступень (𝔅 S)) → Ступень (𝔅 S)
  A ⇒ B = A →ᵖ B
  
  -- отрицание терма (определяется через импликацию)
  
  ¬ : ∀ {S : СхемаСтупени (1 + n)}
      → (A : Ступень (𝔅 S)) → Ступень (𝔅 S)
  ¬ A = ¬ᵖ A
  
  -- разность термов
  
  _╲_ : ∀ {S : СхемаСтупени (1 + n)}
      → (A B : Ступень (𝔅 S)) → Ступень (𝔅 S)
  A ╲ B = A ╲ᵖ B
  
  -- симметрическая разность термов
  
  _፥_ : ∀ {S : СхемаСтупени (1 + n)}
      → (A B : Ступень (𝔅 S)) → Ступень (𝔅 S)
  A ፥ B = A ፥ᵖ B
  
  -- произведение термов
  
  _*_ : ∀ {S1 S2 : СхемаСтупени (1 + n)}
      → (A : Ступень (𝔅 S1)) → (B : Ступень (𝔅 S2)) → Ступень (𝔅 (𝔇 (S1 ∷ S2 ∷ [])))
  A * B = A ×ᵖ B
  
  -- возведение в степень  
    
  _^_ : ∀ {SA SB : СхемаСтупени (1 + n)}
      → (B : Ступень (𝔅 SB)) → (A : Ступень (𝔅 SA)) → Ступень (𝔅 (𝔅 (𝔇 (SA ∷ SB ∷ []))))
  B ^ A = B ^ᵖ A
  
  
  -------------------------------------------------------
  --== Операции над родами структур ==--
  
  -- 5.1. Операции порождения
  
  -- усиления
  -- ослабления
  -- (выполняются автоматически)
  
  -- порождения множества структур
  -- (условие на ступень P и элемент булеана совпадают, т.к. являются одним и тем же
  --   предикатом)
  -- (см. пример бинарных отношений в отдельном файле)
  →𝔅 : ∀ {Sh : СхемаСтупени (1 + n)}
             → (Ступень Sh → hProp _)     -- свойство ступени 
             → Ступень (𝔅 Sh)
  →𝔅 P = P
  
  -- порождения структуры -- операция, обратная предыдущей
  
  -- (аналогично предыдущему, поскольку условие на ступень и элемент булеана совпадают)
  -- Любой элемент ℙΣ P будет искомой ступенью.
  -- TODO: объяснить
  
  ←𝔅 : ∀ {Sh : СхемаСтупени (1 + n)}
             → Ступень (𝔅 Sh)
             → Ступень Sh → hProp _  -- свойство ступени 
  ←𝔅 P = P
  
  
  -- 5.2. Операция синтеза (5 видов?)
  
  -- Отождествление отображений
  
  -- 5.3. Операции расчленения
  
  -- Рассечение
  
  -- Расслоение
  
  -- Декомпозиция
  
  
  --== Протокол операций над родами структур ==--
  
